{
  "backend/main.mo": "Main backend canister defining question paper types, user profiles with roles, authorization checks, and functions for creating and storing papers.",
  "backend/migration.mo": "Migration module converting old user profiles into new profiles by assigning a default teacher role and preserving existing state.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collected summaries of all frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base layer with custom OKLCH color variables and theme definitions for light and dark modes.",
  "frontend/index.html": "Root HTML file setting up the application container and loading the main script.",
  "frontend/src/App.tsx": "Main React app with routing, authentication handling, role-based guards, and profile-setup flow.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component displaying a login prompt when users are not authenticated.",
  "frontend/src/components/AppLayout.tsx": "Provides the main app layout with header navigation that adapts to user role and wraps page content and footer.",
  "frontend/src/components/EditableQuestionList.tsx": "Renders an editable list of questions with add, remove, reorder, and field update controls.",
  "frontend/src/components/LoginButton.tsx": "Displays a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/MergeMetadataForm.tsx": "Form for entering title, subject, and grade metadata when creating a merged paper.",
  "frontend/src/components/MergePapersSelector.tsx": "Lists existing papers with checkboxes to select multiple papers and trigger a merge action.",
  "frontend/src/components/PaperParamsForm.tsx": "Form for configuring paper generation parameters including metadata, counts, and difficulty distribution.",
  "frontend/src/components/PapersEmptyState.tsx": "Shows an empty state card prompting users to generate their first paper.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile creation, collecting name and role with validation and warnings.",
  "frontend/src/components/RoleAccessDenied.tsx": "Displays an access denied message based on user role and allowed roles, offering navigation to the appropriate dashboard.",
  "frontend/src/components/RoleGuard.tsx": "Wraps protected content and checks user role, showing a loading spinner or RoleAccessDenied if unauthorized.",
  "frontend/src/components/SavePaperActions.tsx": "Provides a save button that validates inputs and creates a paper draft, showing success or error toasts.",
  "frontend/src/components/student/DoubtSolverPanel.tsx": "Allows students to submit doubts about a question and shows an AI‑generated answer and explanation.",
  "frontend/src/components/student/PracticeSession.tsx": "Runs an interactive question practice flow with navigation, answer tracking, scoring, and optional doubt solving.",
  "frontend/src/components/student/ResultsSummary.tsx": "Displays post‑practice results including score, correctness breakdown, and per‑question review.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context via Internet Identity, handling login, logout, identity persistence, and status tracking.",
  "frontend/src/hooks/usePapers.ts": "Provides React Query hooks for fetching, saving, generating, and merging question papers via an actor backend.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes.",
  "frontend/src/lib/doubtSolver/localDoubtSolver.ts": "Generates a correct answer and explanation for a question based on difficulty and user doubt text.",
  "frontend/src/lib/generator/paperGenerator.ts": "Builds randomized questions using sample pools and parameters, including difficulty distribution and marks.",
  "frontend/src/lib/merge/mergePapers.ts": "Merges multiple papers by concatenating questions and suggesting combined metadata.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/GeneratePaperPage.tsx": "UI page for generating papers with parameters, previewing questions, and saving results.",
  "frontend/src/pages/MergePapersPage.tsx": "UI page for selecting, merging, previewing, editing, and saving combined papers.",
  "frontend/src/pages/MyPapersPage.tsx": "Lists all user-created papers with loading and empty states, showing metadata cards and links to view or merge papers.",
  "frontend/src/pages/PaperDetailPage.tsx": "Displays a single paper with metadata, supports editing questions to save a new copy, and handles loading or missing paper states.",
  "frontend/src/pages/StudentPortalPage.tsx": "Generates and displays practice questions for students using a form-driven workflow and shows a practice session once generated.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the project's UI styling.",
  "project_state.json": "Tracks the project's metadata, features, and versioned state for the Paperly application."
}