{
  "kind": "build_request",
  "title": "Add Teacher/Student role selection, student warning, and Student Portal with practice solving + doubt helper",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Extend user onboarding to require selecting an account role (Teacher or Student) and persist the role in the user profile. Update the Profile Setup modal to include a role selector and show a prominent warning for students about not using a Teacher account with the exact warning text: \"Warning for students: Do not use a Teacher account. If you use a Teacher account, you will be banned permanently.\"",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "add option to choose teacher or student and add warning for students not to use teacher account if they use it will be banned permenently"
        ]
      },
      "acceptanceCriteria": [
        "On first login (when no profile exists), the profile setup flow requires both a name and a role before continuing.",
        "The user profile stored in the backend includes the selected role and is returned by getCallerUserProfile().",
        "The warning text is displayed in English exactly as specified somewhere clearly visible in the role selection experience (at minimum when Student is selected).",
        "If a user already has a profile, the modal does not re-appear and their role is reused."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Implement role-based navigation and route access: Teacher-only access to existing teacher workflows (Generate, My Papers, Paper Detail, Merge Papers) and add a Student Portal route for Student users. Update the header navigation to show Teacher links only for Teacher role, and show a \"Student Portal\" link only for Student role. When a user attempts to access a route not permitted for their role, show an in-app access denied message explaining they must switch to the correct role/account.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "add option to choose teacher or student"
        ]
      },
      "acceptanceCriteria": [
        "Teacher role users can access: /, /my-papers, /paper/$paperId, /merge and do not see Student Portal in nav by default.",
        "Student role users can access the new Student Portal page and do not see teacher-only nav links.",
        "Direct URL navigation to a disallowed route results in a clear access denied screen/message (no blank page).",
        "No changes are made to immutable paths listed in SYSTEM_CONTEXT (compose new components/pages instead)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Create a Student Portal page that allows students to generate an AI-style practice question paper (using the existing local generator) and solve it interactively. The solving experience must let a student: start a session, answer each multiple-choice question, navigate between questions, submit, and see a results summary (score, correct/incorrect per question, and the correct answer).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "in the student page add feature of solving question papers generated by ai"
        ]
      },
      "acceptanceCriteria": [
        "Student Portal includes a way to generate a new practice paper using existing parameter inputs (title/subject/grade/number of questions/difficulty mix/marks), without requiring saving to the teacher paper list.",
        "Students can select an option for each question; answers persist while navigating between questions.",
        "On submit, the UI shows total score and per-question feedback (selected option, correct option).",
        "The Student Portal is reachable via a dedicated route (e.g., /student) and is only visible/accessible to Student role users."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add an \"AI Doubt Solver\" feature within the Student Portal that lets a student ask a doubt while solving and receive a helpful explanation derived from the current question data (e.g., restating the question, highlighting the correct option, and providing a structured explanation). This must work without any external AI/LLM service integrations.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "and a ai doubt solver for student's doubt"
        ]
      },
      "acceptanceCriteria": [
        "Each question in the Student Portal has a \"Ask Doubt\" / \"Doubt Solver\" UI entry point.",
        "The student can type a doubt/question and receive an immediate response generated locally from the current question context (no network calls to external AI providers).",
        "The response includes at least: the correct answer option and a short explanation section.",
        "The doubt solver UI is usable on mobile and desktop and does not block solving progress."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor (all Motoko logic in backend/main.mo).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text.",
    "Do not serve images from the backend (static assets only)."
  ],
  "nonGoals": [
    "Integrating external AI/LLM providers (OpenAI/Anthropic/etc.).",
    "Real-time chat, WebSockets, or push notifications.",
    "Third-party auth providers beyond Internet Identity.",
    "Introducing external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}